<a href="https://colab.research.google.com/github/KerollinDiniz/Banco-de-Dados-SQL/blob/main/Exercicios_Banco_de_Dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [15]:
%load_ext sql
#import sqlite3

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [19]:
%%sql
sqlite:///banco.db

1. Crie uma tabela chamada "alunos" com os seguintes campos: id (inteiro), nome (texto), idade (inteiro) e curso (texto).

In [17]:
#conexao = sqlite3.connect('banco')
#cursor = conexao.cursor()

In [18]:
#cursor.execute('CREATE TABLE alunos(id INT, nome VARCHAR, idade INT, curso VARCHAR)')

In [21]:
%%sql
create table alunos(id INT, nome VARCHAR(100), idade INT, curso VARCHAR(50));

 * sqlite:///banco.db
(sqlite3.OperationalError) table alunos already exists
[SQL: create table alunos(id INT, nome VARCHAR(100), idade INT, curso VARCHAR(50));]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

2. Insira pelo menos 5 registros de alunos na tabela que você criou no exercício anterior.

In [33]:
%%sql

insert into alunos values(1, 'Alan da Silva', 21, 'Medicina');
insert into alunos values(2, 'Joana de Castro', 19, 'História');
insert into alunos values(3, 'Eduardo Pio', 29, 'Direito');
insert into alunos values(4, 'Mariana Andrade', 32, 'Engenharia Civil');
insert into alunos values(1, 'Guilherme Nogueira', 26, 'Marketing');

select * from alunos;

 * sqlite:///banco.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Alan da Silva', 21, 'Medicina'),
 (2, 'Joana de Castro', 19, 'História'),
 (3, 'Eduardo Pio', 29, 'Direito'),
 (4, 'Mariana Andrade', 32, 'Engenharia Civil'),
 (1, 'Guilherme Nogueira', 26, 'Marketing')]

3. Consultas Básicas Escreva consultas SQL para realizar as seguintes tarefas:
a) Selecionar todos os registros da tabela "alunos".
b) Selecionar o nome e a idade dos alunos com mais de 20 anos.
c) Selecionar os alunos do curso de "Engenharia" em ordem alfabética. d) Contar o número total de alunos na tabela

In [35]:
%sql select * from alunos;

 * sqlite:///banco.db
Done.

[(1, 'Alan da Silva', 21, 'Medicina'),
 (2, 'Joana de Castro', 19, 'História'),
 (3, 'Eduardo Pio', 29, 'Direito'),
 (4, 'Mariana Andrade', 32, 'Engenharia Civil'),
 (1, 'Guilherme Nogueira', 26, 'Marketing')]

In [36]:
%sql select  nome, idade from alunos where idade > 20;

 * sqlite:///banco.db
Done.

[('Alan da Silva', 21),
 ('Eduardo Pio', 29),
 ('Mariana Andrade', 32),
 ('Guilherme Nogueira', 26)]

In [38]:
%sql select * from alunos where curso like '%Engenharia%' order by nome asc

 * sqlite:///banco.db
Done.

[(4, 'Mariana Andrade', 32, 'Engenharia Civil')]

In [39]:
%sql select count (*) from alunos;

 * sqlite:///banco.db
Done.

[(5,)]

4. Atualização e Remoção
a) Atualize a idade de um aluno específico na tabela.
b) Remova um aluno pelo seu ID.

In [43]:
%%sql update alunos set idade=42 where nome='Mariana Andrade';

 * sqlite:///banco.db
1 rows affected.

[]

In [42]:
%sql select * from alunos;

 * sqlite:///banco.db
Done.

[(1, 'Alan da Silva', 21, 'Medicina'),
 (2, 'Joana de Castro', 19, 'História'),
 (3, 'Eduardo Pio', 29, 'Direito'),
 (4, 'Mariana Andrade', 42, 'Engenharia Civil'),
 (1, 'Guilherme Nogueira', 26, 'Marketing')]

In [44]:
%%sql delete from alunos where id=2

 * sqlite:///banco.db
1 rows affected.

[]

In [45]:
%sql select * from alunos;

 * sqlite:///banco.db
Done.

[(1, 'Alan da Silva', 21, 'Medicina'),
 (3, 'Eduardo Pio', 29, 'Direito'),
 (4, 'Mariana Andrade', 42, 'Engenharia Civil'),
 (1, 'Guilherme Nogueira', 26, 'Marketing')]

5. Criar uma Tabela e Inserir Dados Crie uma tabela chamada "clientes" com os campos: id (chave primária), nome (texto), idade (inteiro) e saldo (float). Insira alguns registros de clientes na tabela.

In [49]:
%%sql
create table clientes(id INTEGER PRIMARY KEY, nome VARCHAR(100), idade INT, saldo FLOAT);

 * sqlite:///banco.db
(sqlite3.OperationalError) table clientes already exists
[SQL: create table clientes(id INTEGER PRIMARY KEY, nome VARCHAR(100), idade INT, saldo FLOAT);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [55]:
%sql insert into  clientes values (1, 'Fabiana Oliveira', 46, 3000), (2, 'Isis Bittencourt', 17, 250), (3, 'Arthur Diniz', 29, 412.87), (4, 'Clara Silveira', 63, 856.11), (5, 'Rafael Nascimento', 55, 1054.47);

 * sqlite:///banco.db
5 rows affected.

[]

In [56]:
%sql select * from clientes;

 * sqlite:///banco.db
Done.

[(1, 'Fabiana Oliveira', 46, 3000.0),
 (2, 'Isis Bittencourt', 17, 250.0),
 (3, 'Arthur Diniz', 29, 412.87),
 (4, 'Clara Silveira', 63, 856.11),
 (5, 'Rafael Nascimento', 55, 1054.47)]

6. Consultas e Funções Agregadas Escreva consultas SQL para realizar as seguintes tarefas: a) Selecione o nome e a idade dos clientes com idade superior a 30 anos.b) Calcule o saldo médio dos clientes. c) Encontre o cliente com o saldo máximo. d) Conte quantos clientes têm saldo acima de 1000.

In [57]:
%sql select nome, idade from clientes where idade > 30;

 * sqlite:///banco.db
Done.

[('Fabiana Oliveira', 46), ('Clara Silveira', 63), ('Rafael Nascimento', 55)]

In [61]:
%sql select AVG(saldo) as saldo_medio from clientes;

 * sqlite:///banco.db
Done.

[(1114.69,)]

In [58]:
%sql select nome, saldo from clientes where saldo = (select MAX(saldo) from clientes);

 * sqlite:///banco.db
Done.

[('Fabiana Oliveira', 3000.0)]

In [62]:
%sql select count(*) clientes_saldo_maior_1000 from clientes where saldo> 1000;

 * sqlite:///banco.db
Done.

[(2,)]

7. Atualização e Remoção com Condições a) Atualize o saldo de um cliente específico. b) Remova um cliente pelo seu ID.

In [72]:
%%sql
update clientes set saldo=1500 where nome='Isis Bittencourt';

 * sqlite:///banco.db
1 rows affected.

[]

In [73]:
%sql select * from clientes;

 * sqlite:///banco.db
Done.

[(1, 'Fabiana Oliveira', 46, 3000.0),
 (2, 'Isis Bittencourt', 17, 1500.0),
 (3, 'Arthur Diniz', 29, 412.87),
 (4, 'Clara Silveira', 63, 856.11),
 (5, 'Rafael Nascimento', 55, 1054.47)]

In [76]:
%%sql delete from clientes where id=5

 * sqlite:///banco.db
1 rows affected.

[]

In [77]:
%sql select * from clientes;

 * sqlite:///banco.db
Done.

[(1, 'Fabiana Oliveira', 46, 3000.0),
 (2, 'Isis Bittencourt', 17, 1500.0),
 (3, 'Arthur Diniz', 29, 412.87),
 (4, 'Clara Silveira', 63, 856.11)]

In [78]:
%sql select * from alunos;

 * sqlite:///banco.db
Done.

[(1, 'Alan da Silva', 21, 'Medicina'),
 (3, 'Eduardo Pio', 29, 'Direito'),
 (4, 'Mariana Andrade', 42, 'Engenharia Civil'),
 (1, 'Guilherme Nogueira', 26, 'Marketing')]

8. Junção de Tabelas Crie uma segunda tabela chamada "compras" com os campos: id (chave primária), cliente_id (chave estrangeira referenciando o id da tabela "clientes"), produto (texto) e valor (real). Insira algumas compras associadas a clientes existentes na tabela "clientes". Escreva uma consulta para exibir o nome do cliente, o produto e o valor de cada compra.

In [79]:
%%sql create table compras(id INTEGER PRIMARY KEY, cliente_id INTEGER, produto VARCHAR, valor REAL, foreign key (cliente_id) references clientes(id));

 * sqlite:///banco.db
Done.

[]

In [80]:
%sql select * from compras;

 * sqlite:///banco.db
Done.

[]

In [81]:
%%sql

insert into compras values(1, 1, 'Geladeira', 5500);
insert into compras values(2, 2, 'Computador', 6200);
insert into compras values(3, 3, 'Televisão', 3650);
insert into compras values(4, 4, 'Maquina de Lavar', 1890);
insert into compras values(5, 5, 'Forno Eletrico', 5642);

 * sqlite:///banco.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [82]:
%sql select * from compras;

 * sqlite:///banco.db
Done.

[(1, 1, 'Geladeira', 5500.0),
 (2, 2, 'Computador', 6200.0),
 (3, 3, 'Televisão', 3650.0),
 (4, 4, 'Maquina de Lavar', 1890.0),
 (5, 5, 'Forno Eletrico', 5642.0)]

In [83]:
%%sql select clientes.nome, compras.produto, compras.valor from compras join clientes on compras.cliente_id = clientes.id;

 * sqlite:///banco.db
Done.

[('Fabiana Oliveira', 'Geladeira', 5500.0),
 ('Isis Bittencourt', 'Computador', 6200.0),
 ('Arthur Diniz', 'Televisão', 3650.0),
 ('Clara Silveira', 'Maquina de Lavar', 1890.0)]